-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Apr 21, 2017 at 06:18 PM
-- Server version: 5.6.34
-- PHP Version: 5.6.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `land`
--

-- --------------------------------------------------------

--
-- Table structure for table `countries`
--

CREATE TABLE `countries` (
  `id` smallint(6) NOT NULL,
  `code` int(10) NOT NULL,
  `name` varchar(250) NOT NULL,
  `fullname` varchar(250) NOT NULL,
  `alpha2` varchar(2) NOT NULL,
  `alpha3` varchar(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `countries`
--

INSERT INTO `countries` (`id`, `code`, `name`, `fullname`, `alpha2`, `alpha3`) VALUES
(1, 0, 'None', 'None', 'No', 'No'),
(2, 4, 'АФГАНИСТАН', 'ПЕРЕХОДНОЕ ИСЛАМСКОЕ ГОСУДАРСТВО АФГАНИСТАН', 'AF', 'AFG'),
(3, 8, 'АЛБАНИЯ', 'РЕСПУБЛИКА АЛБАНИЯ', 'AL', 'ALB'),
(4, 10, 'АНТАРКТИДА', 'АНТАРКТИДА', 'AQ', 'ATA'),
(5, 12, 'АЛЖИР', 'АЛЖИРСКАЯ НАРОДНАЯ ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА', 'DZ', 'DZA'),
(6, 16, 'ВОСТОЧНОЕ САМОА', 'АМЕРИКАНСКОЕ САМОА (США)', 'AS', 'ASM'),
(7, 20, 'АНДОРРА', 'КНЯЖЕСТВО АНДОРРА', 'AD', 'AND'),
(8, 24, 'АНГОЛА', 'РЕСПУБЛИКА АНГОЛА', 'AO', 'AGO'),
(9, 28, 'АНТИГУА И БАРБУДА', 'АНТИГУА И БАРБУДА', 'AG', 'ATG'),
(10, 31, 'АЗЕРБАЙДЖАН', 'РЕСПУБЛИКА АЗЕРБАЙДЖАН', 'AZ', 'AZE'),
(11, 32, 'АРГЕНТИНА', 'АРГЕНТИНСКАЯ РЕСПУБЛИКА', 'AR', 'ARG'),
(12, 36, 'АВСТРАЛИЯ', 'АВСТРАЛИЯ', 'AU', 'AUS'),
(13, 40, 'АВСТРИЯ', 'АВСТРИЙСКАЯ РЕСПУБЛИКА', 'AT', 'AUT'),
(14, 44, 'БАГАМЫ', 'СОДРУЖЕСТВО БАГАМЫ', 'BS', 'BHS'),
(15, 48, 'БАХРЕЙН', 'КОРОЛЕВСТВО БАХРЕЙН', 'BH', 'BHR'),
(16, 50, 'БАНГЛАДЕШ', 'НАРОДНАЯ РЕСПУБЛИКА БАНГЛАДЕШ', 'BD', 'BGD'),
(17, 51, 'АРМЕНИЯ', 'РЕСПУБЛИКА АРМЕНИЯ', 'AM', 'ARM'),
(18, 52, 'БАРБАДОС', 'БАРБАДОС', 'BB', 'BRB'),
(19, 56, 'БЕЛЬГИЯ', 'КОРОЛЕВСТВО БЕЛЬГИИ', 'BE', 'BEL'),
(20, 60, 'БЕРМУДЫ', 'БЕРМУДСКИЕ ОСТРОВА', 'BM', 'BMU'),
(21, 64, 'БУТАН', 'КОРОЛЕВСТВО БУТАН', 'BT', 'BTN'),
(22, 68, 'БОЛИВИЯ', 'РЕСПУБЛИКА БОЛИВИЯ', 'BO', 'BOL'),
(23, 70, 'БОСНИЯ И ГЕРЦЕГОВИНА', 'БОСНИЯ И ГЕРЦЕГОВИНА', 'BA', 'BIH'),
(24, 72, 'БОТСВАНА', 'РЕСПУБЛИКА БОТСВАНА', 'BW', 'BWA'),
(25, 74, 'БУВЕ', 'ОСТРОВ БУВЕ', 'BV', 'BVT'),
(26, 76, 'БРАЗИЛИЯ', 'ФЕДЕРАТИВНАЯ РЕСПУБЛИКА БРАЗИЛИЯ', 'BR', 'BRA'),
(27, 84, 'БЕЛИЗ', 'БЕЛИЗ', 'BZ', 'BLZ'),
(28, 86, 'БРИТАН. ТЕРРИТ.', 'БРИТАНСКАЯ ТЕРРИТОРИЯ В ИНДИЙСКОМ ОКЕАНЕ (БРИТ.)', 'IO', 'IOT'),
(29, 90, 'СОЛОМОНОВЫ О-ВА', 'СОЛОМОНОВЫ ОСТРОВА', 'SB', 'SLB'),
(30, 92, 'ВИРГИН. О-ВА, БРИТАНСКИЕ', 'БРИТАНСКИЕ ВИРГИНСКИЕ ОСТРОВА', 'VG', 'VGB'),
(31, 96, 'БРУНЕЙ', 'БРУНЕЙ-ДАРУССАЛАМ', 'BN', 'BRN'),
(32, 100, 'БОЛГАРИЯ', 'РЕСПУБЛИКА БОЛГАРИЯ', 'BG', 'BGR'),
(33, 104, 'МЬЯНМА', 'СОЮЗ МЬЯНМА', 'MM', 'MMR'),
(34, 108, 'БУРУНДИ', 'РЕСПУБЛИКА БУРУНДИ', 'BI', 'BDI'),
(35, 112, 'БЕЛАРУСЬ', 'РЕСПУБЛИКА БЕЛАРУСЬ', 'BY', 'BLR'),
(36, 116, 'КАМБОДЖА', 'КОРОЛЕВСТВО КАМБОДЖА', 'KH', 'KHM'),
(37, 120, 'КАМЕРУН', 'РЕСПУБЛИКА КАМЕРУН', 'CM', 'CMR'),
(38, 124, 'КАНАДА', 'КАНАДА', 'CA', 'CAN'),
(39, 132, 'КАБО-ВЕРДЕ', 'РЕСПУБЛИКА КАБО-ВЕРДЕ', 'CV', 'CPV'),
(40, 136, 'КАЙМАН', 'ОСТРОВА КАЙМАН', 'KY', 'CYM'),
(41, 140, 'ЦЕНТР. - АФР. РЕСПУБЛИКА', 'ЦЕНТРАЛЬНО-АФРИКАНСКАЯ РЕСПУБЛИКА (ЦАР)', 'CF', 'CAF'),
(42, 144, 'ШРИ-ЛАНКА', 'ДЕМОКРАТИЧЕСКАЯ СОЦИАЛИСТИЧЕСКАЯ РЕСПУБЛИКА ШРИ-ЛАНКА', 'LK', 'LKA'),
(43, 148, 'ЧАД', 'РЕСПУБЛИКА ЧАД', 'TD', 'TCD'),
(44, 152, 'ЧИЛИ', 'РЕСПУБЛИКА ЧИЛИ', 'CL', 'CHL'),
(45, 156, 'КИТАЙ', 'КИТАЙСКАЯ НАРОДНАЯ РЕСПУБЛИКА (КНР)', 'CN', 'CHN'),
(46, 158, 'ТАЙВАНЬ', 'ТАЙВАНЬ (В СОСТАВЕ КИТАЯ)', 'TW', 'TWN'),
(47, 162, 'О-В РОЖДЕСТВА', 'ОСТРОВ РОЖДЕСТВА (АВСТРАЛ.)', 'CX', 'CXR'),
(48, 166, 'КОКОСОВЫЕ О-ВА', 'КОКОСОВЫЕ (КИЛИНГ) ОСТРОВА', 'CC', 'CCK'),
(49, 170, 'КОЛУМБИЯ', 'РЕСПУБЛИКА КОЛУМБИЯ', 'CO', 'COL'),
(50, 174, 'КОМОРЫ', 'СОЮЗ КОМОРЫ', 'KM', 'COM'),
(51, 175, 'МАЙОТТА', 'МАЙОТТА', 'YT', 'MYT'),
(52, 178, 'КОНГО', 'РЕСПУБЛИКА КОНГО', 'CG', 'COG'),
(53, 180, 'КОНГО', 'ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА КОНГО', 'CD', 'COD'),
(54, 184, 'О-ВА КУКА', 'ОСТРОВА КУКА (Н. ЗЕЛ.)', 'СК', 'COK'),
(55, 188, 'КОСТА-РИКА', 'РЕСПУБЛИКА КОСТА-РИКА', 'CR', 'CRI'),
(56, 191, 'ХОРВАТИЯ', 'РЕСПУБЛИКА ХОРВАТИЯ', 'HR', 'HRV'),
(57, 192, 'КУБА', 'РЕСПУБЛИКА КУБА', 'CU', 'CUB'),
(58, 196, 'КИПР', 'РЕСПУБЛИКА КИПР', 'CY', 'CYP'),
(59, 203, 'ЧЕХИЯ', 'ЧЕШСКАЯ РЕСПУБЛИКА', 'CZ', 'CZE'),
(60, 204, 'БЕНИН', 'РЕСПУБЛИКА БЕНИН', 'BJ', 'BEN'),
(61, 208, 'ДАНИЯ', 'КОРОЛЕВСТВО ДАНИЯ', 'DK', 'DNK'),
(62, 212, 'ДОМИНИКА', 'СОДРУЖЕСТВО ДОМИНИКИ', 'DM', 'DMA'),
(63, 214, 'ДОМИНИКАНСКАЯ РЕСПУБЛИКА', 'ДОМИНИКАНСКАЯ РЕСПУБЛИКА', 'DO', 'DOM'),
(64, 218, 'ЭКВАДОР', 'РЕСПУБЛИКА ЭКВАДОР', 'EC', 'ECU'),
(65, 222, 'ЭЛЬ-САЛЬВАДОР', 'РЕСПУБЛИКА ЭЛ-САЛЬВАДОР', 'SV', 'SLV'),
(66, 226, 'ЭКВАТОРИАЛЬНАЯ ГВИНЕЯ', 'РЕСПУБЛИКА ЭКВАТОРИАЛЬНАЯ ГВИНЕЯ', 'GQ', 'GNQ'),
(67, 231, 'ЭФИОПИЯ', 'ФЕДЕРАТИВНАЯ ДЕМОКРАТИЧЕСКАЯ  РЕСПУБЛИКА ЭФИОПИЯ', 'ET', 'ETH'),
(68, 232, 'ЭРИТРЕЯ', 'ЭРИТРЕЯ', 'ER', 'ERI'),
(69, 233, 'ЭСТОНИЯ', 'ЭСТОНСКАЯ РЕСПУБЛИКА', 'EE', 'EST'),
(70, 234, 'ФАРЕРСКИЕ О-ВА', 'ФАРЕРСКИЕ ОСТРОВА (В СОСТАВЕ ДАНИИ)', 'FO', 'FRO'),
(71, 238, 'ФОЛКЛЕНДСКИЕ О-ВА', 'ФОЛКЛЕНДСКИЕ ОСТРОВА (МАЛЬВИНСКИЕ)', 'FK', 'FLK'),
(72, 239, 'ЮЖНАЯ ДЖОРДЖИЯ И ЮЖНЫЕ САНДВИЧЕВЫ ОСТРОВА', 'ЮЖНАЯ ДЖОРДЖИЯ И ЮЖНЫЕ САНДВИЧЕВЫ ОСТРОВА', 'GS', 'SGS'),
(73, 242, 'ФИДЖИ', 'РЕСПУБЛИКА ОСТРОВОВ ФИДЖИ', 'FJ', 'FJI'),
(74, 246, 'ФИНЛЯНДИЯ', 'ФИНЛЯНДСКАЯ РЕСПУБЛИКА', 'FI', 'FIN'),
(75, 248, 'ЭЛАНДСКИЕ ОСТРОВА', 'ЭЛАНДСКИЕ ОСТРОВА', 'AX', 'ALA'),
(76, 250, 'ФРАНЦИЯ', 'ФРАНЦУЗСКАЯ РЕСПУБЛИКА', 'FR', 'FRA'),
(77, 254, 'ГВИАНА', 'ФРАНЦУЗСКАЯ ГВИАНА (ФР.)', 'GF', 'GUF'),
(78, 258, 'ФРАНЦУЗСКАЯ ПОЛИНЕЗИЯ', 'ФРАНЦУЗСКАЯ ПОЛИНЕЗИЯ (ФР.)', 'PF', 'PYF'),
(79, 260, 'ФР. ЮЖНЫЕ ТЕРРИТОРИИ', 'ФРАНЦУЗСКИЕ ЮЖНЫЕ ТЕРРИТОРИИ (ФР.)', 'TF', 'ATF'),
(80, 262, 'ДЖИБУТИ', 'РЕСПУБЛИКА ДЖИБУТИ', 'DJ', 'DJI'),
(81, 266, 'ГАБОН', 'ГАБОНСКАЯ РЕСПУБЛИКА', 'GA', 'GAB'),
(82, 268, 'ГРУЗИЯ', 'РЕСПУБЛИКА ГРУЗИЯ', 'GE', 'GEO'),
(83, 270, 'ГАМБИЯ', 'РЕСПУБЛИКА ГАМБИЯ', 'GM', 'GMB'),
(84, 275, 'ПАЛЕСТИНСКАЯ ТЕРРИТОРИЯ, ОККУПИРОВАННАЯ', 'ОККУПИРОВАННАЯ ПАЛЕСТИНСКАЯ ТЕРРИТОРИЯ', 'PS', 'PSE'),
(85, 276, 'ГЕРМАНИЯ', 'ФЕДЕРАТИВНАЯ РЕСПУБЛИКА ГЕРМАНИЯ', 'DE', 'DEU'),
(86, 288, 'ГАНА', 'РЕСПУБЛИКА ГАНА', 'GH', 'GHA'),
(87, 292, 'ГИБРАЛТАР', 'ГИБРАЛТАР (БРИТ.)', 'GI', 'GIB'),
(88, 296, 'КИРИБАТИ', 'РЕСПУБЛИКА КИРИБАТИ', 'KI', 'KIR'),
(89, 300, 'ГРЕЦИЯ', 'ГРЕЧЕСКАЯ РЕСПУБЛИКА', 'GR', 'GRC'),
(90, 304, 'ГРЕНЛАНДИЯ', 'ГРЕНЛАНДИЯ', 'GL', 'GRL'),
(91, 308, 'ГРЕНАДА', 'ГРЕНАДА', 'GD', 'GRD'),
(92, 312, 'ГВАДЕЛУПА', 'ГВАДЕЛУПА (ФР.)', 'GP', 'GLP'),
(93, 316, 'ГУАМ', 'ГУАМ (США)', 'GU', 'GUM'),
(94, 320, 'ГВАТЕМАЛА', 'РЕСПУБЛИКА ГВАТЕМАЛА', 'GT', 'GTM'),
(95, 324, 'ГВИНЕЯ', 'ГВИНЕЙСКАЯ РЕСПУБЛИКА', 'GN', 'GIN'),
(96, 328, 'ГАЙАНА', 'РЕСПУБЛИКА ГАЙАНА', 'GY', 'GUY'),
(97, 332, 'ГАИТИ', 'РЕСПУБЛИКА ГАИТИ', 'HT', 'HTI'),
(98, 334, 'ХЕРД И МАКДОНАЛЬД', 'ОСТРОВ ХЕРД И ОСТРОВА МАКДОНАЛЬД', 'HM', 'HMD'),
(99, 336, 'ВАТИКАН', 'ПАПСКИЙ ПРЕСТОЛ (ГОСУДАРСТВО-ГОРОД ВАТИКАН)', 'VA', 'VAT'),
(100, 340, 'ГОНДУРАС', 'РЕСПУБЛИКА ГОНДУРАС', 'HN', 'HND'),
(101, 344, 'ГОНКОНГ', 'СПЕЦИАЛЬНЫЙ АДМИНИСТРАТИВНЫЙ РЕГИОН КИТАЯ ГОНКОНГ', 'HK', 'HKG'),
(102, 348, 'ВЕНГРИЯ', 'ВЕНГЕРСКАЯ РЕСПУБЛИКА', 'HU', 'HUN'),
(103, 352, 'ИСЛАНДИЯ', 'РЕСПУБЛИКА ИСЛАНДИЯ', 'IS', 'ISL'),
(104, 356, 'ИНДИЯ', 'РЕСПУБЛИКА ИНДИЯ', 'IN', 'IND'),
(105, 360, 'ИНДОНЕЗИЯ', 'РЕСПУБЛИКА ИНДОНЕЗИЯ', 'ID', 'IDN'),
(106, 364, 'ИРАН', 'ИСЛАМСКАЯ РЕСПУБЛИКА ИРАН', 'IR', 'IRN'),
(107, 368, 'ИРАК', 'РЕСПУБЛИКА ИРАК', 'IQ', 'IRQ'),
(108, 372, 'ИРЛАНДИЯ', 'ИРЛАНДИЯ', 'IE', 'IRL'),
(109, 376, 'ИЗРАИЛЬ', 'ГОСУДАРСТВО ИЗРАИЛЬ', 'IL', 'ISR'),
(110, 380, 'ИТАЛИЯ', 'ИТАЛЬЯНСКАЯ РЕСПУБЛИКА', 'IT', 'ITA'),
(111, 384, 'КОТ Д\'ИВУАР', 'РЕСПУБЛИКА КОТ Д\'ИВУАР', 'CI', 'CIV'),
(112, 388, 'ЯМАЙКА', 'ЯМАЙКА', 'JM', 'JAM'),
(113, 392, 'ЯПОНИЯ', 'ЯПОНИЯ', 'JP', 'JPN'),
(114, 398, 'КАЗАХСТАН', 'РЕСПУБЛИКА КАЗАХСТАН', 'KZ', 'KAZ'),
(115, 400, 'ИОРДАНИЯ', 'ИОРДАНСКОЕ ХАШИМИТСКОЕ КОРОЛЕВСТВО', 'JO', 'JOR'),
(116, 404, 'КЕНИЯ', 'РЕСПУБЛИКА КЕНИЯ', 'KE', 'KEN'),
(117, 408, 'КОРЕЯ (КНДР)', 'КОРЕЙСКАЯ НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА', 'KP', 'PRK'),
(118, 410, 'КОРЕЯ', 'РЕСПУБЛИКА КОРЕЯ', 'KR', 'KOR'),
(119, 414, 'КУВЕЙТ', 'ГОСУДАРСТВО КУВЕЙТ', 'KW', 'KWT'),
(120, 417, 'КЫРГЫЗСТАН', 'РЕСПУБЛИКА КЫРГЫЗСТАН', 'KG', 'KGZ'),
(121, 418, 'ЛАОС', 'ЛАОССКАЯ НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА', 'LA', 'LAO'),
(122, 422, 'ЛИВАН', 'ЛИВАНСКАЯ РЕСПУБЛИКА', 'LB', 'LBN'),
(123, 426, 'ЛЕСОТО', 'КОРОЛЕВСТВО ЛЕСОТО', 'LS', 'LSO'),
(124, 428, 'ЛАТВИЯ', 'ЛАТВИЙСКАЯ РЕСПУБЛИКА', 'LV', 'LVA'),
(125, 430, 'ЛИБЕРИЯ', 'РЕСПУБЛИКА ЛИБЕРИЯ', 'LR', 'LBR'),
(126, 434, 'ЛИВИЯ', 'СОЦИАЛИСТИЧЕСКАЯ НАРОДНАЯ ЛИВИЙСКАЯ АРАБСКАЯ ДЖАМАХИРИЯ', 'LY', 'LBY'),
(127, 438, 'ЛИХТЕНШТЕЙН', 'КНЯЖЕСТВО ЛИХТЕНШТЕЙН', 'LI', 'LIE'),
(128, 440, 'ЛИТВА', 'ЛИТОВСКАЯ РЕСПУБЛИКА', 'LT', 'LTU'),
(129, 442, 'ЛЮКСЕМБУРГ', 'ВЕЛИКОЕ ГЕРЦОГСТВО ЛЮКСЕМБУРГ', 'LU', 'LUX'),
(130, 446, 'МАКАО', 'СПЕЦИАЛЬНЫЙ АДМИНИСТРАТИВНЫЙ РЕГИОН КИТАЯ МАКАО', 'MO', 'MAC'),
(131, 450, 'МАДАГАСКАР', 'ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА МАДАГАСКАР', 'MG', 'MDG'),
(132, 454, 'МАЛАВИ', 'РЕСПУБЛИКА МАЛАВИ', 'MW', 'MWI'),
(133, 458, 'МАЛАЙЗИЯ', 'МАЛАЙЗИЯ', 'MY', 'MYS'),
(134, 462, 'МАЛЬДИВЫ', 'МАЛЬДИВСКАЯ РЕСПУБЛИКА', 'MV', 'MDV'),
(135, 466, 'МАЛИ', 'РЕСПУБЛИКА МАЛИ', 'ML', 'MLI'),
(136, 470, 'МАЛЬТА', 'РЕСПУБЛИКА МАЛЬТА', 'MT', 'MLT'),
(137, 474, 'МАРТИНИКА', 'МАРТИНИКА (ФР.)', 'MQ', 'MTQ'),
(138, 478, 'МАВРИТАНИЯ', 'ИСЛАМСКАЯ РЕСПУБЛИКА МАВРИТАНИЯ', 'MR', 'MRT'),
(139, 480, 'МАВРИКИЙ', 'РЕСПУБЛИКА МАВРИКИЙ', 'MU', 'MUS'),
(140, 484, 'МЕКСИКА', 'МЕКСИКАНСКИЕ СОЕДИНЕННЫЕ ШТАТЫ', 'MX', 'MEX'),
(141, 492, 'МОНАКО', 'КНЯЖЕСТВО МОНАКО', 'MC', 'MCO'),
(142, 496, 'МОНГОЛИЯ', 'МОНГОЛИЯ', 'MN', 'MHG'),
(143, 498, 'МОЛДОВА', 'РЕСПУБЛИКА МОЛДОВА', 'MD', 'MDA'),
(144, 499, 'ЧЕРНОГОРИЯ', 'РЕСПУБЛИКА ЧЕРНОГОРИЯ', 'ME', 'MNE'),
(145, 500, 'МОНТСЕРРАТ', 'МОНТСЕРРАТ (БРИТ.)', 'MS', 'MSR'),
(146, 504, 'МАРОККО', 'КОРОЛЕВСТВО МАРОККО', 'MA', 'MAR'),
(147, 508, 'МОЗАМБИК', 'РЕСПУБЛИКА МОЗАМБИК', 'MZ', 'MOZ'),
(148, 512, 'ОМАН', 'СУЛТАНАТ ОМАН', 'OM', 'OMN'),
(149, 516, 'НАМИБИЯ', 'РЕСПУБЛИКА НАМИБИЯ', 'NA', 'NAM'),
(150, 520, 'НАУРУ', 'РЕСПУБЛИКА НАУРУ', 'NR', 'NRU'),
(151, 524, 'НЕПАЛ', 'КОРОЛЕВСТВО НЕПАЛ', 'NP', 'NPL'),
(152, 528, 'НИДЕРЛАНДЫ', 'КОРОЛЕВСТВО НИДЕРЛАНДЫ', 'NL', 'NLD'),
(153, 530, 'НИДЕРЛАНДСКИЕ АНТИЛЫ', 'НИДЕРЛАНДСКИЕ АНТИЛЫ', 'AN', 'ANT'),
(154, 533, 'АРУБА', 'ОСТРОВ АРУБА', 'AW', 'ABW'),
(155, 540, 'НОВАЯ КАЛЕДОНИЯ', 'НОВАЯ КАЛЕДОНИЯ', 'NC', 'NCL'),
(156, 548, 'ВАНУАТУ', 'РЕСПУБЛИКА ВАНУАТУ', 'VU', 'VUT'),
(157, 554, 'НОВАЯ ЗЕЛАНДИЯ', 'НОВАЯ ЗЕЛАНДИЯ', 'NZ', 'NZL'),
(158, 558, 'НИКАРАГУА', 'РЕСПУБЛИКА НИКАРАГУА', 'NI', 'NIC'),
(159, 562, 'НИГЕР', 'РЕСПУБЛИКА НИГЕР', 'NE', 'NER'),
(160, 566, 'НИГЕРИЯ', 'ФЕДЕРАТИВНАЯ РЕСПУБЛИКА НИГЕРИЯ', 'NG', 'NGA'),
(161, 570, 'НИУЭ', 'РЕСПУБЛИКА НИУЭ', 'NU', 'NIU'),
(162, 574, 'НОРФОЛК', 'ОСТРОВ НОРФОЛК', 'NF', 'NFK'),
(163, 578, 'НОРВЕГИЯ', 'КОРОЛЕВСТВО НОРВЕГИЯ', 'NO', 'NOR'),
(164, 580, 'МАРИАНСКИЕ ОСТРОВА', 'СОДРУЖЕСТВО СЕВЕРНЫХ МАРИАНСКИХ ОСТРОВОВ', 'MP', 'MNP'),
(165, 581, 'МАЛЫЕ ТИХООК. ОСТРОВА (США)', 'МАЛЫЕ ТИХООКЕАНСКИЕ ОТДАЛЕННЫЕ ОСТРОВА (США)', 'UM', 'UMI'),
(166, 583, 'МИКРОНЕЗИЯ', 'ФЕДЕРАТИВНЫЕ ШТАТЫ МИКРОНЕЗИИ', 'FM', 'FSM'),
(167, 584, 'МАРШАЛЛОВЫ ОСТРОВА', 'РЕСПУБЛИКА МАРШАЛЛОВЫ ОСТРОВА', 'MH', 'MHL'),
(168, 585, 'ПАЛАУ', 'РЕСПУБЛИКА ПАЛАУ', 'PW', 'PLW'),
(169, 586, 'ПАКИСТАН', 'ИСЛАМСКАЯ РЕСПУБЛИКА ПАКИСТАН', 'PK', 'PAK'),
(170, 591, 'ПАНАМА', 'РЕСПУБЛИКА ПАНАМА', 'PA', 'PAN'),
(171, 598, 'ПАПУА - НОВАЯ ГВИНЕЯ', 'ПАПУА - НОВАЯ ГВИНЕЯ', 'PG', 'PNG'),
(172, 600, 'ПАРАГВАЙ', 'РЕСПУБЛИКА ПАРАГВАЙ', 'PY', 'PRY'),
(173, 604, 'ПЕРУ', 'РЕСПУБЛИКА ПЕРУ', 'PE', 'PER'),
(174, 608, 'ФИЛИППИНЫ', 'РЕСПУБЛИКА ФИЛИППИНЫ', 'PH', 'PHL'),
(175, 612, 'ПИТКЭРН', 'ПИТКЭРН (БРИТ.)', 'PN', 'PCN'),
(176, 616, 'ПОЛЬША', 'РЕСПУБЛИКА ПОЛЬША', 'PL', 'POL'),
(177, 620, 'ПОРТУГАЛИЯ', 'ПОРТУГАЛЬСКАЯ РЕСПУБЛИКА', 'PT', 'PRT'),
(178, 624, 'ГВИНЕЯ-БИСАУ', 'РЕСПУБЛИКА ГВИНЕЯ-БИСАУ', 'GW', 'GNB'),
(179, 626, 'ТИМОР-ЛЕСТЕ', 'ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА ТИМОР-ЛЕСТЕ', 'TP', 'TMP'),
(180, 630, 'ПУЭРТО-РИКО', 'ПУЭРТО-РИКО', 'PR', 'PRI'),
(181, 634, 'КАТАР', 'ГОСУДАРСТВО КАТАР', 'QA', 'QAT'),
(182, 638, 'РЕЮНЬОН', 'РЕЮНЬОН', 'RE', 'REU'),
(183, 642, 'РУМЫНИЯ', 'РУМЫНИЯ', 'RO', 'ROM'),
(184, 643, 'РОССИЯ', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'RU', 'RUS'),
(185, 646, 'РУАНДА', 'РУАНДИЙСКАЯ РЕСПУБЛИКА', 'RW', 'RWA'),
(186, 654, 'СВЯТАЯ ЕЛЕНА', 'ОСТРОВ СВЯТОЙ ЕЛЕНЫ (БРИТ.)', 'SH', 'SHN'),
(187, 659, 'СЕНТ-КИТС И НЕВИС', 'ФЕДЕРАЦИЯ СЕНТ-КИТС (СЕНТ-КРИСТОФЕР) И НЕВИС', 'KN', 'KNA'),
(188, 660, 'АНГИЛЬЯ', 'АНГИЛЬЯ', 'AI', 'AIA'),
(189, 662, 'СЕНТ-ЛЮСИЯ', 'СЕНТ-ЛЮСИЯ', 'LC', 'LCA'),
(190, 666, 'СЕН-ПЬЕР И МИКЕЛОН', 'СЕН-ПЬЕР И МИКЕЛОН (ФР.)', 'PM', 'SPM'),
(191, 670, 'СЕНТ-ВИНСЕНТ И ГРЕНАДИНЫ', 'СЕНТ-ВИНСЕНТ И ГРЕНАДИНЫ', 'VC', 'VCT'),
(192, 674, 'САН-МАРИНО', 'РЕСПУБЛИКА САН-МАРИНО', 'SM', 'SMR'),
(193, 678, 'САН-ТОМЕ И ПРИНСИПИ', 'ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА САН-ТОМЕ И ПРИНСИПИ', 'ST', 'STR'),
(194, 682, 'САУДОВСКАЯ АРАВИЯ', 'КОРОЛЕВСТВО САУДОВСКАЯ АРАВИЯ', 'SA', 'SAU'),
(195, 686, 'СЕНЕГАЛ', 'РЕСПУБЛИКА СЕНЕГАЛ', 'SN', 'SEN'),
(196, 688, 'СЕРБИЯ', 'РЕСПУБЛИКА СЕРБИЯ', 'RS', 'SRB'),
(197, 690, 'СЕЙШЕЛЫ', 'РЕСПУБЛИКА СЕЙШЕЛЫ', 'SC', 'SYC'),
(198, 694, 'СЬЕРРА-ЛЕОНЕ', 'РЕСПУБЛИКА СЬЕРРА-ЛЕОНЕ', 'SL', 'SLE'),
(199, 702, 'СИНГАПУР', 'РЕСПУБЛИКА СИНГАПУР', 'SG', 'SGP'),
(200, 703, 'СЛОВАКИЯ', 'СЛОВАЦКАЯ РЕСПУБЛИКА', 'SK', 'SVK'),
(201, 704, 'ВЬЕТНАМ', 'СОЦИАЛИСТИЧЕСКАЯ РЕСПУБЛИКА ВЬЕТНАМ', 'VN', 'VNM'),
(202, 705, 'СЛОВЕНИЯ', 'РЕСПУБЛИКА СЛОВЕНИЯ', 'SI', 'SVN'),
(203, 706, 'СОМАЛИ', 'СОМАЛИЙСКАЯ РЕСПУБЛИКА', 'SO', 'SOM'),
(204, 710, 'ЮЖНАЯ АФРИКА', 'ЮЖНО-АФРИКАНСКАЯ РЕСПУБЛИКА', 'ZA', 'ZAF'),
(205, 716, 'ЗИМБАБВЕ', 'РЕСПУБЛИКА ЗИМБАБВЕ', 'ZW', 'ZWE'),
(206, 724, 'ИСПАНИЯ', 'КОРОЛЕВСТВО ИСПАНИЯ', 'ES', 'ESP'),
(207, 732, 'ЗАПАДНАЯ САХАРА', 'ЗАПАДНАЯ САХАРА', 'EH', 'ESH'),
(208, 736, 'СУДАН', 'РЕСПУБЛИКА СУДАН', 'SD', 'SDN'),
(209, 740, 'СУРИНАМ', 'РЕСПУБЛИКА СУРИНАМ', 'SR', 'SUR'),
(210, 744, 'ШПИЦБЕРГЕН И ЯН-МАЙЕН', 'ШПИЦБЕРГЕН И ЯН-МАЙЕН (НОРВ.)', 'SJ', 'SJM'),
(211, 748, 'СВАЗИЛЕНД', 'КОРОЛЕВСТВО СВАЗИЛЕНД', 'SZ', 'SWZ'),
(212, 752, 'ШВЕЦИЯ', 'КОРОЛЕВСТВО ШВЕЦИЯ', 'SE', 'SWE'),
(213, 756, 'ШВЕЙЦАРИЯ', 'ШВЕЙЦАРСКАЯ КОНФЕДЕРАЦИЯ', 'CH', 'CHE'),
(214, 760, 'СИРИЯ', 'СИРИЙСКАЯ АРАБСКАЯ РЕСПУБЛИКА', 'SY', 'SYR'),
(215, 762, 'ТАДЖИКИСТАН', 'РЕСПУБЛИКА ТАДЖИКИСТАН', 'TJ', 'TJK'),
(216, 764, 'ТАИЛАНД', 'КОРОЛЕВСТВО ТАИЛАНД', 'TH', 'THA'),
(217, 768, 'ТОГО', 'ТОГОЛЕЗСКАЯ РЕСПУБЛИКА', 'TG', 'TGO'),
(218, 772, 'ТОКЕЛАУ', 'ТОКЕЛАУ (ЮНИОН) (Н. ЗЕЛ.)', 'TK', 'TKL'),
(219, 776, 'ТОНГА', 'КОРОЛЕВСТВО ТОНГА', 'TO', 'TON'),
(220, 780, 'ТРИНИДАД И ТОБАГО', 'РЕСПУБЛИКА ТРИНИДАД И ТОБАГО', 'TT', 'TTO'),
(221, 784, 'ОБЪЕД. АРАБСКИЕ ЭМИРАТЫ', 'ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ', 'AE', 'ARE'),
(222, 788, 'ТУНИС', 'ТУНИССКАЯ РЕСПУБЛИКА', 'TN', 'TUN'),
(223, 792, 'ТУРЦИЯ', 'ТУРЕЦКАЯ РЕСПУБЛИКА', 'TR', 'TUR'),
(224, 795, 'ТУРКМЕНИЯ', 'ТУРКМЕНИСТАН', 'TM', 'TKM'),
(225, 796, 'ТЕРКС И КАЙКОС', 'ОСТРОВА ТЕРКС И КАЙКОС (БРИТ.)', 'TC', 'TCA'),
(226, 798, 'ТУВАЛУ', 'ТУВАЛУ', 'TV', 'TUV'),
(227, 800, 'УГАНДА', 'РЕСПУБЛИКА УГАНДА', 'UG', 'UGA'),
(228, 804, 'УКРАИНА', 'УКРАИНА', 'UA', 'UKR'),
(229, 807, 'МАКЕДОНИЯ', 'РЕСПУБЛИКА МАКЕДОНИЯ', 'MK', 'MKD'),
(230, 818, 'ЕГИПЕТ', 'АРАБСКАЯ РЕСПУБЛИКА ЕГИПЕТ (АРЕ)', 'EG', 'EGY'),
(231, 826, 'СОЕДИНЕННОЕ КОРОЛЕВСТВО', 'СОЕДИНЕННОЕ КОРОЛЕВСТВО ВЕЛИКОБРИТАНИИ И СЕВЕРНОЙ ИРЛАНДИИ', 'GB', 'GBR'),
(232, 831, 'ГЕРНСИ', 'ГЕРНСИ', 'GG', 'GGY'),
(233, 832, 'ДЖЕРСИ', 'ДЖЕРСИ', 'JE', 'JEY'),
(234, 833, 'О-В МЭН', 'ОСТРОВ МЭН', 'IM', 'IMY'),
(235, 834, 'ТАНЗАНИЯ', 'ОБЪЕДИНЕННАЯ РЕСПУБЛИКА ТАНЗАНИЯ (ОРТ)', 'TZ', 'TZA'),
(236, 840, 'США', 'СОЕДИНЕННЫЕ ШТАТЫ АМЕРИКИ', 'US', 'USA'),
(237, 850, 'ВИРГИН. О-ВА', 'ВИРГИНСКИЕ ОСТРОВА (США)', 'VI', 'VIR'),
(238, 854, 'БУРКИНА-ФАСО', 'БУРКИНА-ФАСО', 'BF', 'BFA'),
(239, 858, 'УРУГВАЙ', 'ВОСТОЧНАЯ РЕСПУБЛИКА УРУГВАЙ', 'UY', 'URY'),
(240, 860, 'УЗБЕКИСТАН', 'РЕСПУБЛИКА УЗБЕКИСТАН', 'UZ', 'UZB'),
(241, 862, 'ВЕНЕСУЭЛА', 'БОЛИВАРИЙСКАЯ РЕСПУБЛИКА ВЕНЕСУЭЛА', 'VE', 'VEN'),
(242, 876, 'УОЛЛИС И ФУТУНА', 'ОСТРОВА УОЛЛИС И ФУТУНА', 'WF', 'WLF'),
(243, 882, 'САМОА', 'НЕЗАВИСИМОЕ ГОСУДАРСТВО САМОА', 'WS', 'WSM'),
(244, 887, 'ЙЕМЕН', 'ЙЕМЕНСКАЯ РЕСПУБЛИКА', 'YE', 'YEM'),
(245, 894, 'ЗАМБИЯ', 'РЕСПУБЛИКА ЗАМБИЯ', 'ZM', 'ZMB');

-- --------------------------------------------------------

--
-- Table structure for table `queries`
--

CREATE TABLE `queries` (
  `id` smallint(5) UNSIGNED NOT NULL,
  `text` text NOT NULL,
  `date` date NOT NULL,
  `city` varchar(255) NOT NULL,
  `country` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `queries`
--

INSERT INTO `queries` (`id`, `text`, `date`, `city`, `country`) VALUES
(102, '{\"city\":{\"id\":485609,\"name\":\"Svinkino\",\"coord\":{\"lon\":32.3667,\"lat\":59.8167},\"country\":\"RU\",\"population\":0},\"cod\":\"200\",\"message\":7.687583,\"cnt\":7,\"list\":[{\"dt\":1492765200,\"temp\":{\"day\":2.93,\"min\":1.52,\"max\":2.93,\"night\":1.52,\"eve\":2.93,\"morn\":2.93},\"pressure\":1003.28,\"humidity\":98,\"weather\":[{\"id\":800,\"main\":\"Clear\",\"description\":\"ясно\",\"icon\":\"01d\"}],\"speed\":2.36,\"deg\":232,\"clouds\":92,\"rain\":3.17},{\"dt\":1492851600,\"temp\":{\"day\":7.16,\"min\":-3.17,\"max\":7.29,\"night\":-3.17,\"eve\":6.17,\"morn\":0.63},\"pressure\":1000.11,\"humidity\":69,\"weather\":[{\"id\":600,\"main\":\"Snow\",\"description\":\"небольшой снегопад\",\"icon\":\"13d\"}],\"speed\":1.72,\"deg\":243,\"clouds\":0,\"snow\":0.81},{\"dt\":1492938000,\"temp\":{\"day\":6.13,\"min\":-6.15,\"max\":7.46,\"night\":-2.76,\"eve\":6.38,\"morn\":-6.15},\"pressure\":1007.47,\"humidity\":72,\"weather\":[{\"id\":800,\"main\":\"Clear\",\"description\":\"ясно\",\"icon\":\"01d\"}],\"speed\":1.41,\"deg\":345,\"clouds\":44},{\"dt\":1493024400,\"temp\":{\"day\":2.14,\"min\":-5.27,\"max\":5.17,\"night\":-5.27,\"eve\":4.02,\"morn\":-1.16},\"pressure\":1016.72,\"humidity\":91,\"weather\":[{\"id\":601,\"main\":\"Snow\",\"description\":\"снегопад\",\"icon\":\"13d\"}],\"speed\":1.43,\"deg\":249,\"clouds\":88,\"rain\":0.98,\"snow\":5.46},{\"dt\":1493110800,\"temp\":{\"day\":5.42,\"min\":1.76,\"max\":6.44,\"night\":6,\"eve\":6.44,\"morn\":1.76},\"pressure\":1014.82,\"humidity\":0,\"weather\":[{\"id\":501,\"main\":\"Rain\",\"description\":\"дождь\",\"icon\":\"10d\"}],\"speed\":7.58,\"deg\":153,\"clouds\":99,\"rain\":9.72},{\"dt\":1493197200,\"temp\":{\"day\":7.71,\"min\":2.69,\"max\":7.71,\"night\":2.69,\"eve\":4.49,\"morn\":4.72},\"pressure\":1020.13,\"humidity\":0,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":5.44,\"deg\":223,\"clouds\":15,\"rain\":0.27},{\"dt\":1493283600,\"temp\":{\"day\":10.86,\"min\":5.83,\"max\":10.86,\"night\":10.59,\"eve\":10.61,\"morn\":5.83},\"pressure\":1024.78,\"humidity\":0,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":5.01,\"deg\":174,\"clouds\":99,\"rain\":0.9}]}', '2017-04-21', 'запорожье', 0),
(103, '{\"city\":{\"id\":687700,\"name\":\"Zaporizhzhya\",\"coord\":{\"lon\":35.1833,\"lat\":47.8167},\"country\":\"UA\",\"population\":0},\"cod\":\"200\",\"message\":8.1270849,\"cnt\":7,\"list\":[{\"dt\":1492765200,\"temp\":{\"day\":5.5,\"min\":2.35,\"max\":5.74,\"night\":2.35,\"eve\":5.74,\"morn\":5.5},\"pressure\":1006.59,\"humidity\":100,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":1.21,\"deg\":118,\"clouds\":76,\"rain\":1.81},{\"dt\":1492851600,\"temp\":{\"day\":8.11,\"min\":1.48,\"max\":9.92,\"night\":6.03,\"eve\":9.92,\"morn\":1.48},\"pressure\":1011.87,\"humidity\":100,\"weather\":[{\"id\":600,\"main\":\"Snow\",\"description\":\"небольшой снегопад\",\"icon\":\"13d\"}],\"speed\":6.37,\"deg\":261,\"clouds\":48,\"snow\":0.41},{\"dt\":1492938000,\"temp\":{\"day\":8.33,\"min\":3.54,\"max\":9.01,\"night\":3.54,\"eve\":8.33,\"morn\":4.35},\"pressure\":1008.2,\"humidity\":100,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":3.21,\"deg\":31,\"clouds\":80,\"rain\":1.49},{\"dt\":1493024400,\"temp\":{\"day\":8.39,\"min\":1.39,\"max\":8.39,\"night\":4.33,\"eve\":7.27,\"morn\":1.39},\"pressure\":1012.66,\"humidity\":86,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":5.28,\"deg\":281,\"clouds\":12,\"rain\":0.38},{\"dt\":1493110800,\"temp\":{\"day\":14.47,\"min\":3.65,\"max\":14.47,\"night\":3.65,\"eve\":9.74,\"morn\":9.01},\"pressure\":1027.79,\"humidity\":0,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":5,\"deg\":212,\"clouds\":12},{\"dt\":1493197200,\"temp\":{\"day\":17.81,\"min\":10.64,\"max\":17.81,\"night\":10.64,\"eve\":13.34,\"morn\":11.02},\"pressure\":1027.83,\"humidity\":0,\"weather\":[{\"id\":800,\"main\":\"Clear\",\"description\":\"ясно\",\"icon\":\"01d\"}],\"speed\":6.97,\"deg\":139,\"clouds\":0},{\"dt\":1493283600,\"temp\":{\"day\":18.61,\"min\":12.48,\"max\":18.61,\"night\":12.49,\"eve\":15.76,\"morn\":12.48},\"pressure\":1023.56,\"humidity\":0,\"weather\":[{\"id\":800,\"main\":\"Clear\",\"description\":\"ясно\",\"icon\":\"01d\"}],\"speed\":8.62,\"deg\":125,\"clouds\":0}]}', '2017-04-21', 'запорожье', 804),
(104, '{\"city\":{\"id\":524901,\"name\":\"Moscow\",\"coord\":{\"lon\":37.6156,\"lat\":55.7522},\"country\":\"RU\",\"population\":0},\"cod\":\"200\",\"message\":5.8994268,\"cnt\":7,\"list\":[{\"dt\":1492765200,\"temp\":{\"day\":7.5,\"min\":4.46,\"max\":7.5,\"night\":4.46,\"eve\":5.96,\"morn\":7.5},\"pressure\":1003.91,\"humidity\":60,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":6.76,\"deg\":228,\"clouds\":64,\"rain\":0.28},{\"dt\":1492851600,\"temp\":{\"day\":5.81,\"min\":2.68,\"max\":6.89,\"night\":2.68,\"eve\":6.02,\"morn\":2.88},\"pressure\":987.95,\"humidity\":97,\"weather\":[{\"id\":501,\"main\":\"Rain\",\"description\":\"дождь\",\"icon\":\"10d\"}],\"speed\":4.52,\"deg\":226,\"clouds\":76,\"rain\":7.08},{\"dt\":1492938000,\"temp\":{\"day\":4.63,\"min\":-0.61,\"max\":5.46,\"night\":-0.61,\"eve\":5.28,\"morn\":1.75},\"pressure\":995.8,\"humidity\":89,\"weather\":[{\"id\":600,\"main\":\"Snow\",\"description\":\"небольшой снегопад\",\"icon\":\"13d\"}],\"speed\":5.61,\"deg\":251,\"clouds\":36,\"rain\":0.31,\"snow\":0.29},{\"dt\":1493024400,\"temp\":{\"day\":6.44,\"min\":-2.32,\"max\":7.47,\"night\":-0.52,\"eve\":6.77,\"morn\":-2.32},\"pressure\":1002.93,\"humidity\":78,\"weather\":[{\"id\":800,\"main\":\"Clear\",\"description\":\"ясно\",\"icon\":\"01d\"}],\"speed\":3.88,\"deg\":301,\"clouds\":24},{\"dt\":1493110800,\"temp\":{\"day\":10.42,\"min\":6.06,\"max\":10.42,\"night\":9.25,\"eve\":8.64,\"morn\":6.06},\"pressure\":1010.37,\"humidity\":0,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":7.38,\"deg\":212,\"clouds\":37,\"rain\":1.3},{\"dt\":1493197200,\"temp\":{\"day\":15.86,\"min\":10.14,\"max\":15.86,\"night\":10.14,\"eve\":12.64,\"morn\":12.12},\"pressure\":1012.43,\"humidity\":0,\"weather\":[{\"id\":500,\"main\":\"Rain\",\"description\":\"легкий дождь\",\"icon\":\"10d\"}],\"speed\":11.01,\"deg\":217,\"clouds\":20,\"rain\":0.38},{\"dt\":1493283600,\"temp\":{\"day\":16.31,\"min\":9.49,\"max\":16.31,\"night\":9.49,\"eve\":12.26,\"morn\":12.63},\"pressure\":1019.92,\"humidity\":0,\"weather\":[{\"id\":800,\"main\":\"Clear\",\"description\":\"ясно\",\"icon\":\"01d\"}],\"speed\":10.29,\"deg\":198,\"clouds\":21}]}', '2017-04-21', 'москва', 643);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `countries`
--
ALTER TABLE `countries`
  ADD PRIMARY KEY (`id`),
  ADD KEY `code` (`code`);

--
-- Indexes for table `queries`
--
ALTER TABLE `queries`
  ADD PRIMARY KEY (`id`),
  ADD KEY `country` (`country`),
  ADD KEY `country_2` (`country`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `countries`
--
ALTER TABLE `countries`
  MODIFY `id` smallint(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=246;
--
-- AUTO_INCREMENT for table `queries`
--
ALTER TABLE `queries`
  MODIFY `id` smallint(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=105;
--
-- Constraints for dumped tables
--

--
-- Constraints for table `queries`
--
ALTER TABLE `queries`
  ADD CONSTRAINT `queries_ibfk_1` FOREIGN KEY (`country`) REFERENCES `countries` (`code`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
